Repository: jonnitto/Jonnitto.PrettyEmbedVideo
Catalog: Resources/Private/Translations/*/NodeTypes/Content/Track.xlf
Languages: de

# ui.label
source: Captions
de: Untertitel

# groups.track
source: Captions
de: Untertitel

# properties.kind
source: Type
de: Typ

# properties.kind.ui.help.message
source: ### Subtitles Subtitles provide translation of content that cannot be understood by the viewer. For example dialogue or text that is not English in an English language film. They may also contain additional content, usually extra background information. For example the text at the beginning of the Star Wars films, or the date, time, and location of a scene. ### Captions Closed captions provide a transcription and possibly a translation of audio. It may include important non-verbal information such as music cues or sound effects. It may indicate the cue's source (e.g. music, text, character). **Suitable for users who are deaf or when the sound is muted.** ### Descriptions Textual description of the video content. **Suitable for users who are blind or where the video cannot be seen.** ### Chapters titles Chapter titles are intended to be used when the user is navigating the media resource. ### Metadata Tracks used by scripts. Not visible to the user.
de: ### Untertitel audiomediale Inhalte Untertitel beinhalten Inhaltsangaben welche vom Zuschauer nicht verstanden werden kann. Zum Beispiel ein Dialog oder Text in einem deutschsprachigen Film welcher aber nicht Deutsch ist. Sie können aber auch zusätlichen Inhalt beinhalten, meistens sind dies Hintergrundinformationen. ### Untertitel visuelle Medieninhalte Untertitel visuelle Medieninhalte beinhalten eine Transkription and möglicherweise auch eine Übersetzung vom Ton. Es beinhaltet wichtige non-verbale Informationen wie Musik oder Soundeffekte. **Passend für taube Benutzer oder wenn der Ton ausgeschalten ist.** ### Beschreibungen (descriptions) Textliche Beschreibung vom Inhalt des Videos. **Passend für blinde Benutzer oder wo das Video nicht gesehen werden kann** ### Kapiteltitel Kapiteltitel sind für die Navigation innerhalb des Videos vorgesehen. ### Metadata Diese können von Programmiercode verwendet werden. Sie sind nicht sichtbar für den Benutzer.

# properties.kind.selectBoxEditor.values.subtitles
source: Subtitles
de: Untertitel audiomediale Inhalte

# properties.kind.selectBoxEditor.values.captions
source: Captions
de: Untertitel visuelle Medieninhalte

# properties.kind.selectBoxEditor.values.descriptions
source: Descriptions
de: Beschreibungen (descriptions)

# properties.kind.selectBoxEditor.values.chapters
source: Chapters titles
de: Kapiteltitel

# properties.label.ui.help.message
source: A user-readable title of the text track which is used by the browser when listing available text tracks
de: Ein lesbarer Titel von dem Untertitel welcher bei der Auflistung vom Browser verwendet wird

# properties.src
source: File
de: Datei

# properties.src.ui.help.message
source: Must be an `.vtt` file. Other filetypes will be ignored.
de: Muss eine `.vtt` Datei sein. Andere Dateitypen werden ignoriert.

# properties.srclang
source: Language
de: Sprache

# properties.srclang.ui.help.message
source: Language of the track text data. If the kind attribute is set to Subtitles, then it must be defined.
de: Sprache von dem Untertitel. Wenn der Typ auf *Untertitel audiomediale Inhalte* gesetzt ist, muss dieser Wert definiert werden.

# show
source: Show tracks
de: Zeige Untertitel

# hide
source: Hide tracks
de: Blende Untertitel aus

source: Default
de: Standard

# needSrclang
source: The language need to be set
de: Die Sprache muss gesetzt werden
